package
{
   import flash.utils.Dictionary;
   
   public class AccessBypass
   {
       
      
      private var Main:*;

      private static var data_dict:Dictionary = new Dictionary();

      private var url_data:Object;

      private var DATA_ITEMLIST:String = "0/いちぶモンスターのすで/0/0/0/0/0/0/0//200///\n1/スモールライフポーション/0/0/0/0/0/0/0//50///\n2/ライフポーション/0/0/0/0/0/0/0//50///\n3/スモールマナポーション/0/0/0/0/0/0/0//400///\n4/マナポーション/0/0/0/0/0/0/0//400///\n10/モルケドのにっき/0/0/0/0/0/0/0//0///わるだくみが つづられている\n12/へんげのくすり/0/0/0/0/0/0/0//50///すがたを じざいに かえられる\n20/ラージライフポーション/0/0/0/0/0/0/0//3200///\n21/ラージマナポーション/0/0/0/0/0/0/0//3200///\n100/ライフ/0/0/0/0/0/0/0//50///\n101/マナ/0/0/0/0/0/0/0//50///\n201/バッグ/0/0/0/0/0/0/0//50//dummy:0/アイテムを たくさん もてるようになる\n300/かいだんをおりる/0/0/0/0/0/0/0//50///\n301/ちじょうへもどる/0/0/0/0/0/0/0//50///\n500/りゅうせいのまきもの/0/0/0/0/0/0/0/MeteorSC/5000///たいりょうの いんせきを おとす\n501/てんばつのまきもの/0/0/0/0/0/0/0/LightningSC/5000///むさべつに かみなりを おとす\n502/せいなるまきもの/0/0/0/0/0/0/0/SanctuarySC/5000///しゅういに せいいきを しきつめる\n503/わなのまきもの/0/0/0/0/0/0/0/BoobyTrapSC/5000///フロアぜんたいに わなを せっちする\n504/とうしのまきもの/0/0/0/0/0/0/0/DetectionSC/5000///かべの むこうがわの てきを みつける\n505/かなしばりのまきもの/0/0/0/0/0/0/0/StunSC/5000///てきの うごきを ふうじる\n506/たいきゃくのまきもの/0/0/0/0/0/0/0/EscapeSC/5000///スタートちてんへ テレポートする\n507/みがわりのまきもの/0/0/0/0/0/0/0/DecoySC/5000///みがわりを おいて てきを かくらんする\n508/ぶんしんのまきもの/0/0/0/0/0/0/0/SplitSC/5000///じぶんの ぶんしんを つくって たたかわせる\n800/リング/0/0/0/1/0/0/0//5000/ring:mpr:hit:dog//\n801/エレキリング/0/0/0/1/0/0/0//20000//sta:50_regl:75_regp:75_mp:40/\n802/ミラーリング/0/0/0/1/0/0/0//20000//ref:100_hrg:4_rega:10/\n803/ヘルメスリング/0/0/0/1/0/0/0//20000//spd:50_dog:120_regu:40/\n804/スパイクリング/0/0/0/1/0/0/0//20000//ref:50_ata:10_hp:20_mp:20/\n805/バリアリング/0/0/0/1/0/0/0//20000//gad:20_rega:15_regu:40/\n806/レインボーリング/0/0/0/1/0/0/0//20000//regf:40_regc:40_regl:40_regp:40_regu:40/\n807/ウィザードリング/0/0/0/1/0/0/0//20000//mrg:200_rega:10_gadr:25/\n820/アミュレット/0/0/0/10/0/0/0//10000/ring:hpr//\n821/パワーブレスレット/0/0/0/10/0/0/0//20000//ata:20_hpr:50_gadr:10/\n822/アイスブローチ/0/0/0/10/0/0/0//20000//mrg:40_gad:4_regc:100_mpr:40/\n823/マジカルブローチ/0/0/0/10/0/0/0//20000//mpr:100_rega:20_sta:10_spd:25/\n824/ホーリーブローチ/0/0/0/10/0/0/0//20000//hrg:10_rega:20_regu:100/\n900/バックラー/0/0/0/5/0/10/0//100/shield:ref:sta//\n901/スモールシールド/0/0/0/10/1/12/0//500/shield//\n902/ラウンドシールド/0/0/0/8/3/18/20//1200/shield:brn//\n903/カイトシールド/0/0/0/16/2/24/0//3200/shield:ref//\n904/タワーシールド/0/0/0/18/8/28/40//5000/shield:brn//\n905/ゴシックシールド/0/0/0/24/4/36/16//7000/shield:sta:brn//\n906/スタウトシールド/1/0/0/15/9/40/80/StrongHold/8000/shield:ref:brn//\n907/マンゴーシュ/0/7/10/0/2/0/0//5000/shield:ata:atc//\n908/エルダーシールド/0/0/0/32/0/32/0//8000/shield:sta//\n909/クリスタルシールド/0/0/0/52/4/16/0//10000/shield:ref:sta:brn//\n910/ジェネラルシールド/0/0/0/36/10/32/48//12000/shield:sta:brn//\n911/ディバインシールド/0/0/0/40/5/42/24//16000/shield:brn//\n912/ギガントシールド/1/0/0/42/12/52/90/Press/20000/shield:ref:brn//\n920/タートルシェル/0/0/0/5/0/10/0//5000//gad:10_regf:50_regc:50_hrg:7/\n921/フォートレス/1/0/0/20/9/40/120/StrongHold/20000//defr:100_rega:10_regu:40_hpr:100/\n922/レインボーシールド/0/0/0/8/3/18/20//15000//regf:50_regc:50_regl:50_regp:50_regu:50/\n923/ドラゴンシールド/0/0/0/24/4/36/16//18000//defr:80_regf:80_gad:8_hpr:40_mrg:40/\n924/アイスシールド/0/0/0/18/8/28/40//12000//defr:80_gadr:20_regc:200_regf:100/\n925/ミラーシールド/0/0/0/32/0/32/0//25000//defr:80_ref:200_regu:100_rega:10/\n926/イージス/0/0/0/40/5/42/24//40000//defr:100_regu:100_rega:20_gadr:40/\n927/オリハルコン/0/21/30/0/0/0/0//25000//atc:200_dog:80_mpr:100_regu:50_mrg:100/\n1000/ショートソード/0/4/7/0/2/0/0/Slash/200/sword:numB:ran:pir:cnt:sho//\n1001/サーベル/0/5/9/0/0/0/0/Rush/500/sword:numC:ran:cnt:frz:dog:blc//\n1002/ロングソード/0/6/12/0/4/0/0/Chilling/1200/sword:frz:ran//\n1003/ファルシオン/0/10/13/0/0/0/0/Smash/1800/sword:numA:ran:frz:blc:sho//\n1004/ブロードソード/0/12/20/0/4/0/0/Giga/3000/sword:numD:frz:sho:siz//\n1005/カタナ/1/18/24/0/0/0/0/Kamaitati/4500/sword:numC:ran:dog:frz:blc//\n1006/タルワール/0/16/22/0/0/0/0/Tornado/7000/sword:numA:ran:timA//\n1007/ツヴァイハンダー/1/20/40/0/12/0/0/Wind/6400/sword:numA:cnt:frz:dfo:blc//\n1008/バスターソード/0/20/28/0/4/0/0/Giga/10500/sword:sho:siz//\n1009/グラディウス/0/24/31/0/2/0/0/Slash2/12000/sword:numA:ran:sho:pir:cnt//\n1010/ファルカタ/0/22/32/0/2/0/0/Wind/14000/sword:numA:cnt:frz:dfo//\n1011/レイピア/0/28/36/0/2/0/0/Rush/16000/sword:numC:ran:cnt:dog:dfo//\n1012/シャムシール/0/24/28/0/2/0/0/BladeGale/16000/sword:numB:ran:frz:dfo//\n1013/グレートソード/1/30/50/0/12/0/0/Giga/18000/sword:numD:frz:sho//\n1014/フランベルジェ/1/32/45/0/4/0/0/FlameHush/8000/sword:ran:cst:fir:bur//\n1015/クレイモア/1/36/47/0/0/0/0/LifeGuard/18000/sword:timC:cst//\n1020/だいぼうちょう/0/7/11/0/10/0/0/Mince/5000//atc:80_hp:40_crt:10/\n1021/カラドボルグ/1/30/50/0/18/0/0/Giga/50000//atc:200_brk:80_frz:4_siz:1_spd:-50/\n1022/ラブレソード/0/11/15/0/0/0/0/RabreShot/0//dummy:0/\n1023/シュレッダー/0/4/7/0/0/0/0/Slash/4500//atc:100_ran:4_cnt:6_pir:4/\n1024/エアフルーレ/0/5/9/0/0/0/0/Rush/5500//atc:120_ran:1_cnt:4_dog:200/\n1025/アイスブレード/0/6/12/0/4/0/0/Chilling/7000//dmg:60_dmgc:32_ran:2_frz:2_regc:60/\n1026/ドラゴンキラー/0/14/20/0/8/0/0/Wind/18000//atc:100_dmg:100_cnt:2_ctg:64_regf:40/\n1027/むらさき/1/18/24/0/0/0/0/Kamaitati/30000//atc:200_ran:6_num:20_dra:10_hpr:-75/\n1028/むらさき/1/18/24/0/0/0/0/Kamaitati/30000//atc:200_ran:6_num:20_dra:10_hpr:-75/\n1029/デュランダル/0/24/31/0/0/0/0/Slash2/40000//atc:1000_dfo:20_pir:10_wbk:10/\n1100/ハンドアックス/0/5/10/0/6/0/0/Massive/400/axe:numA:ran:timA//\n1101/アックス/0/8/12/0/6/0/0/Jump/1500/axe:numA:ran:cnt:frz:siz//\n1102/バトルアックス/1/16/23/0/8/0/0/Impact/3500/axe:numA:ran:frz//\n1103/ウォーアックス/1/20/30/0/10/0/0/Spinning/5500/axe:timA:frz//\n1104/グレートアックス/1/28/36/0/12/0/0/Crash/8000/axe:numA:frz:cnt//\n1105/ハチェット/0/12/16/0/4/0/0/Throwing/2000/axe:numB:ran:frz:imp//\n1106/マサカリ/0/25/35/0/8/0/0/Jump/7500/axe:numA:ran:cnt:frz:siz//\n1107/ハルバード/1/33/58/0/12/0/0/Spinning/9000/axe:timA:frz//\n1108/フランキスカ/0/26/31/0/4/0/0/Wheel/6000/axe:numA:ran:timA:pir//\n1109/トマホーク/0/25/35/0/4/0/0/Throwing/12000/axe:numB:ran:imp//\n1110/タバール/0/30/37/0/6/0/0/Impact/14000/axe:numA:ran//\n1111/ギガントアックス/1/55/67/0/15/0/0/Crash/18000/axe:numA:frz:cnt//\n1120/ホッパー/0/8/12/0/6/0/0/Jump/5500//atc:120_cnt:4_frz:1_ctg:4/\n1121/バタフライ/0/12/16/0/4/0/0/Throwing/8700//atc:100_num:12_ran:2_frz:1/\n1122/フリッカー/0/5/10/0/6/0/0/Massive/4700//tim:4_ran:2_num:4_sho:8_frz:1/\n1123/デストロイヤー/1/28/36/0/12/0/0/Crash/35000//atc:120_num:3_cnt:3_brk:40/\n1124/エンプレス/0/30/37/0/4/0/0/Impact/40000//atc:40_num:11_ran:2_sho:1_hpr:80/\n1125/シャドウスワロウ/0/26/31/0/2/0/0/Wheel/40000//atc:80_num:3_pir:8_hit:160_dog:160/\n1200/ダガー/0/1/4/0/0/0/0/Rapid/100/dagger:numC:pir:ran//\n1201/ダーク/0/2/8/0/0/0/0/Dance/300/dagger:numB:spr//\n1202/スティレット/0/1/10/0/0/0/0/Venom/1000/dagger:timC:dth//\n1203/バゼラード/0/7/16/0/1/0/0/Piercing/2000/dagger:numB:ran:cnt//\n1204/チンクエディア/0/5/15/0/0/0/0/BoobyTrap/4000/dagger:numB:ran//\n1205/クリス/0/10/18/0/1/0/0/Haste/6000/dagger:timC:cst//\n1206/ダーツ/0/18/24/0/0/0/0/Rapid/10000/dagger:numC:pir:ran//\n1207/リングダガー/0/22/26/0/0/0/0/Dance/12000/dagger:numB:spr//\n1208/クナイ/0/20/25/0/0/0/0/Mikiri/15000/dagger:numB:ran:cst//\n1209/テレク/0/24/29/0/0/0/0/Decoy/12000/dagger:numA:ran:timC//\n1210/アサシンダガー/0/20/30/0/0/0/0/Assassination/14000/dagger:numA:ran:cst:dth//\n1211/チャクラム/0/28/32/0/0/0/0/Shuttle/16000/dagger:numB:pir:timB//\n1220/スティンガー/0/1/4/0/0/0/0/Rapid/7000//num:20_ran:1_pir:2_frz:1/\n1221/ハーベストナイフ/0/2/8/0/0/0/0/Dance/8000//atc:100_num:4_spr:4_mdr:20/\n1222/アイスピック/0/1/20/0/0/0/0/Piercing/9000//ran:1_num:8_dfo:40_crt:10_dth:5/\n1223/ディフェンダー/0/24/29/0/0/0/0/Decoy/25000//gad:-7_defa:40_num:4_hp:160_regu:40/\n1224/ツールナイフ/0/5/15/0/0/0/0/BoobyTrap/20000//num:6_agi:250_hp:20_mp:20/\n1225/はくひょう/0/20/30/0/0/0/0/Assassination/30000//num:4_cnt:2_ran:4_dog:300_gadr:-75/\n1300/ショートボウ/1/2/6/0/6/0/0/Arrow/250/bow:numB:pir:hom:bou//\n1301/ハンターボウ/1/4/8/0/4/0/0/Stun/800/bow:numB:pir:hom:brk//\n1302/ロングボウ/1/2/14/0/10/0/0/Rain/1600/bow:numB:cnt//\n1303/コンポジットボウ/1/5/13/0/6/0/0/Poison/2700/bow:numB:pir:hom:bou//\n1304/バトルボウ/1/12/18/0/8/0/0/Spread/4500/bow:numB:pir:cnt:hom:bou//\n1305/クロスボウ/1/11/15/0/16/0/0/Machine/3600/bow:numA:pir:hom:bou//\n1306/シージボウ/1/17/24/0/12/0/0/Flame/7200/bow:numA:pir:cst:bur//\n1307/キラーボウ/1/14/20/0/12/0/0/Snipe/5800/bow:numB:pir:bou:brk//\n1308/エルブンボウ/1/18/27/0/8/0/0/Satellite/8400/bow:numA:pir:timB:brk:ran//\n1309/レンジャーボウ/1/20/27/0/6/0/0/Poison/9000/bow:numB:pir:hom//\n1310/アームボウ/0/16/18/0/9/0/0/Machine/10000/bow:numA:pir//\n1311/バリスタ/1/24/42/0/16/0/0/Rain/12000/bow:numC//\n1312/アルバレスト/1/28/39/0/16/0/0/Machine/15000/bow:numA:pir:hom//\n1313/エルダーボウ/1/30/35/0/6/0/0/AbsorbArrow/16000/bow:numA:pir:cnt:hom:bou//\n1314/タイタンボウ/1/36/56/0/16/0/0/Titanic/20000/bow:numA:cnt//\n1320/エンゼルボウ/1/6/12/0/6/0/0/LightArrow/16000//dmg:80_dfo:20_hit:80_dog:80_hrg:7/\n1321/アイスシューター/1/2/6/0/6/0/0/Arrow/7500//atc:120_dmgc:32_pir:4/\n1322/トラブルメーカー/1/2/14/0/10/0/0/Rain/8800//atc:80_cof:20_num:12/\n1323/アボロン/1/12/18/0/8/0/0/Spread/12000//atc:200_num:12_sho:4_dmgf:24_hom:1/\n1324/みかづき/1/18/27/0/8/0/0/Satellite/24000//atc:200_ran:2_pir:4_brk:60_dmgl:24/\n1325/スナイパー/1/14/20/0/12/0/0/Snipe/19000//atc:320_pir:12_dfo:60_frz:3/\n1326/シューティングスター/1/33/46/0/16/0/0/Machine/35000//atc:120_dmgl:24_num:2_stb:1_regl:60/\n1400/ファイアロッド/1/2/6/0/4/0/0/FireBall/400/staff:numA:cnt:fir:bur:rgo:hom:bou//\n1401/アイスロッド/1/3/5/0/8/0/0/IceBlast/800/staff:numA:cnt:rgo:hom:bou//\n1402/ストーンロッド/1/5/12/0/2/0/0/StoneWall/1500/staff:timA:siz//\n1403/フラッシュロッド/1/7/13/0/6/0/0/Ray/3400/staff:numA:frz:rgo//\n1404/バトルロッド/1/13/19/0/4/0/0/Split/6500/staff:numB:timB:frz//\n1405/メテオロッド/1/12/16/0/10/0/0/Meteor/9000/staff:numA:bur:rgo//\n1406/エナジーロッド/1/15/20/0/6/0/0/ManaOrb/12000/staff:numA:frz//\n1407/エレキロッド/1/1/7/0/4/0/0/SparkBall/1200/staff:numA:cnt:rgo:hom:frz//\n1408/フレイムロッド/1/6/13/0/4/0/0/FlameThrower/2800/staff:numA:bur:ran:rgo//\n1409/スノーロッド/1/10/17/0/12/0/0/Blizzard/7500/staff:timA:rgo//\n1410/サンダーロッド/1/18/24/0/8/0/0/Lightning/15000/staff:numA:rgo//\n1411/フロストロッド/1/8/14/0/6/0/0/IceBrand/10000/staff:numA:timC//\n1412/ヒートロッド/1/8/14/0/6/0/0/FireBrand/10000/staff:numA:timC//\n1413/マジカルロッド/1/11/17/0/6/0/0/Missile/5000/staff:numB//\n1414/チリングロッド/1/17/29/0/8/0/0/IceBeam/12000/staff:pir:rgo//\n1415/バブルロッド/1/20/23/0/6/0/0/Barrier/15000/staff:numB:timC//\n1416/アースロッド/1/18/31/0/12/0/0/Quake/18000/staff:frz//\n1417/チャージロッド/1/8/14/0/6/0/0/ThunderBrand/10000/staff:numA:timC//\n1418/フローズンロッド/1/22/28/0/10/0/0/FrozenOrb/20000/staff:numA:ran:rgo:bou//\n1419/マグマロッド/1/20/30/0/10/0/0/Volcano/20000/staff:numA:timA:rgo:bou//\n1420/サンフラワー/1/2/6/0/4/0/0/FireBall/6000//atc:200_num:17_fir:1_bou:1_hp:80/\n1421/アイスキャノン/1/3/5/0/8/0/0/IceBlast/8000//dmg:40_cnt:7_regc:80/\n1422/レールガン/1/7/13/0/6/0/0/Ray/15000//atc:200_dmg:80_frz:2_agi:100/\n1423/ドラゴンヘッド/1/24/30/0/10/0/0/HeatBreath/20000//atc:100_num:10_hp:100_regf:40/\n1424/バイオハザード/1/15/23/0/10/0/0/RottenBreath/18000//atc:160_num:2_ran:2_regp:80/\n1425/ゴッドスタッフ/1/18/24/0/8/0/0/Lightning/35000//atc:160_dmg:40_num:6_hpr:100/\n1426/バロックランチャー/1/11/17/0/7/0/0/Missile/30000//atc:80_num:4_agi:200_mp:100/\n1427/マーメイドキッス/1/20/23/0/0/0/0/Barrier/35000//num:4_hpr:60_regu:40_regl:-40/\n1500/クラブ/0/1/5/0/2/0/0/Heal/170/mace:spr:cnt//\n1501/メイス/0/5/7/0/2/0/0/Protect/350/mace:numB:timC//\n1502/バトルタクト/0/1/3/0/0/0/0/Boost/900/mace:numB:timC//\n1503/モーニングスター/0/7/12/0/6/0/0/Punish/1500/mace:numA:sho:spr//\n1504/チャームステッキ/0/2/4/0/0/0/0/Confusion/3300/mace:numA//\n1505/ウォーハンマー/0/18/25/0/10/0/0/Stamp/4500/mace:siz:sho:brk//\n1506/セイクリッドクロス/0/2/7/0/2/0/0/Sanctuary/7700/mace:numA:ran//\n1507/スパイクメイス/0/14/23/0/2/0/0/Reflect/8000/mace:numB:timC//\n1508/マジックメイス/0/14/23/0/2/0/0/MShield/8000/mace:numB:timC//\n1509/キュアステッキ/0/11/16/0/0/0/0/Refresh/10000/mace:numB:timC//\n1510/スプリンクラー/0/16/24/0/2/0/0/MDrain/12000/mace:spr//\n1511/フレイル/0/21/30/0/4/0/0/Baptism/12000/mace:numA:ran//\n1512/ギガントクラブ/1/36/48/0/12/0/0/Heal/13000/mace:spr:cnt//\n1513/ブランチ/0/2/7/0/2/0/0/Mfield/14000/mace:numA//\n1520/かなぼう/1/25/35/0/12/0/0/ThunderStrike/14000//hp:120_dmg:100_regl:80_gadr:30/\n1521/ライフスティック/0/1/5/0/2/0/0/Heal/6500//ata:16_spr:2_agi:80_hrg:10_regu:40/\n1522/ジャッジガベル/0/7/12/0/6/0/0/Punish/7500//dmg:100_spr:4_cof:10_regu:100/\n1523/ヘブンズガーデナー/0/2/7/0/0/0/0/Sanctuary/19000//atc:200_num:8_hpr:70_mpr:70_rega:20/\n1524/アイスクラッシャー/0/18/25/0/10/0/0/Stamp/16000//atc:200_dmgf:32_siz:2_regc:40_hpr:40/\n1525/ジェスター/0/2/4/0/0/0/0/Confusion/12000//num:4_agi:60_mrg:400_rega:25_regu:-100/\n1526/ガーディアン/1/20/25/0/0/0/0/Protect/15000//num:4_hpr:75_gadr:50_spd:-25/\n1600/スカルナイトのけいやくしょ/1/1/1/0/2/0/0/SumSkalF1/1000/summon:numA//\n1601/ゴートマンのけいやくしょ/1/1/1/0/2/0/0/SumGoatF1/1500/summon:numA//\n1602/ヘクトールのけいやくしょ/1/1/1/0/2/0/0/SumSkalF3/25000//hpr:20_gadr:20/\n1603/バフォメットのけいやくしょ/1/1/1/0/2/0/0/SumGoatF2/20000//hpr:40_mpr:40/\n1604/ボーンナイトのけいやくしょ/1/1/1/0/2/0/0/SumSkalF2/10000/summon:numA//\n1610/スカルアーチャーのけいやくしょ/1/1/1/0/2/0/0/SumSkalH1/1200/summon:numA//\n1611/ゴートアーチャーのけいやくしょ/1/1/1/0/2/0/0/SumGoatH1/2000/summon:numA//\n1612/ナイトクランのけいやくしょ/1/1/1/0/2/0/0/SumGoatH2/8000/summon:numA//\n1613/ボーンスナイパーのけいやくしょ/1/1/1/0/2/0/0/SumSkalH2/12000/summon:numA//\n1614/デスクランのけいやくしょ/1/1/1/0/2/0/0/SumGoatH3/14000/summon:numA//\n1620/ガーゴイルのけいやくしょ/1/1/1/0/2/0/0/SumGargoyle1/2000/summon:numA//\n1630/ゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem1/3000/summon:numA//\n1631/ストーンゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem2/5000/summon:numA//\n1632/ファイアゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem3/12000/summon:numA//\n1633/アイスゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem4/15000/summon:numA//\n1634/ゴールデンゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem5/20000/summon:numD//\n1635/ブラッドゴーレムのけいやくしょ/1/1/1/0/2/0/0/SumGolem6/18000/summon:numD//\n1640/Lスライムのけいやくしょ/1/1/1/0/2/0/0/SumSlime1/4000/summon:numA//\n1641/Lポイズンスライムのけいやくしょ/1/1/1/0/2/0/0/SumSlime2/6000/summon:numA//\n1642/Lブラッドスライムのけいやくしょ/1/1/1/0/2/0/0/SumSlime3/8000/summon:numA//\n1643/Lメタルスライムのけいやくしょ/1/1/1/0/2/0/0/SumSlime4/20000/summon:numD//\n1650/マッドフラワーのけいやくしょ/1/1/1/0/2/0/0/SumFlower1/3200/summon:numA//\n1651/ケイブスターのけいやくしょ/1/1/1/0/2/0/0/SumFlower2/8000/summon:numA//\n1660/デーモンのけいやくしょ/1/1/1/0/2/0/0/SumDemon1/4000/summon:numA//\n1661/アークデーモンのけいやくしょ/1/1/1/0/2/0/0/SumDemon2/12000/summon:numA//\n1670/マッドビーストのけいやくしょ/1/1/1/0/2/0/0/SumBeast1/6400/summon:numA//\n1680/グールのけいやくしょ/1/1/1/0/2/0/0/SumOgre1/2800/summon:numA//\n1681/オーガのけいやくしょ/1/1/1/0/2/0/0/SumOgre2/5500/summon:numA//\n1682/トロールのけいやくしょ/1/1/1/0/2/0/0/SumOgre3/8000/summon:numD//\n1683/サイクロプスのけいやくしょ/1/1/1/0/2/0/0/SumOgre4/10000/summon:numD//\n1690/ファミリアのけいやくしょ/1/1/1/0/2/0/0/SumFamiliar/3500/summon:numA//\n1700/グレーターデーモンのけいやくしょ/1/1/1/0/2/0/0/SumGreatDemon1/16000/summon:numD//\n1710/エンジェルのけいやくしょ/1/1/1/0/2/0/0/SumAngel1/7000/summon:numA//\n1711/パズズのけいやくしょ/1/1/1/0/2/0/0/SumPazuzu/20000//hpr:20_regf:80/\n1712/レイヴンのけいやくしょ/1/1/1/0/2/0/0/SumAngel2/14000/summon:numA//\n1713/カマエルのけいやくしょ/1/1/1/0/2/0/0/SumAngel3/30000//hpr:20_rega:20/\n1720/サキュバスのけいやくしょ/1/1/1/0/2/0/0/SumSuccubus1/6000/summon:numA//\n1721/リリスのけいやくしょ/1/1/1/0/2/0/0/SumSuccubus2/12000/summon:numD//\n1730/ヴァンパイアのけいやくしょ/1/1/1/0/2/0/0/SumVampire1/9000/summon:numA//\n1740/ロウムアーマーのけいやくしょ/1/1/1/0/2/0/0/SumRoamArmor1/8000/summon:numA//\n1741/デスアーマーのけいやくしょ/1/1/1/0/2/0/0/SumRoamArmor2/14000/summon:numD//\n1742/デビルアーマーのけいやくしょ/1/1/1/0/2/0/0/SumRoamArmor3/20000/summon:numD//\n1750/ドラゴンのけいやくしょ/1/1/1/0/2/0/0/SumDragon1/20000/summon:numD//\n1760/サハギンのけいやくしょ/1/1/1/0/2/0/0/SumSahagin1/3000/summon:numA//\n1761/マーマンのけいやくしょ/1/1/1/0/2/0/0/SumSahagin2/9000/summon:numA//\n1770/ボマーのけいやくしょ/1/1/1/0/2/0/0/SumBommer1/3500/summon:numA//\n1771/ステインポットのけいやくしょ/1/1/1/0/2/0/0/SumBommer2/11000/summon:numA//\n1780/サーペントのけいやくしょ/1/1/1/0/2/0/0/SumSerpent1/8000/summon:numD//\n1781/エビルウィードのけいやくしょ/1/1/1/0/2/0/0/SumSerpent2/24000/summon:numD//\n1782/シードラゴンのけいやくしょ/1/1/1/0/2/0/0/SumSerpent3/28000/summon:numD//\n1790/ゴールデンローチのけいやくしょ/1/1/1/0/2/0/0/SumRoach2/20000/summon:numA//\n1800/インプのけいやくしょ/1/1/1/0/2/0/0/SumImp1/1000/summon:numA//\n1801/コロボックルのけいやくしょ/1/1/1/0/2/0/0/SumImp2/8000/summon:numA//\n1802/レプラコーンのけいやくしょ/1/1/1/0/2/0/0/SumImp3/10000/summon:numA//\n1803/ノームのけいやくしょ/1/1/1/0/2/0/0/SumImp4/12000/summon:numA//\n1804/ジョーカーのけいやくしょ/1/1/1/0/2/0/0/SumImp5/20000//hpr:20_regu:80/\n1810/ナーガのけいやくしょ/1/1/1/0/2/0/0/SumNaga1/12000/summon:numA//\n1811/ナーガラージャのけいやくしょ/1/1/1/0/2/0/0/SumNaga2/18000/summon:numD//\n1812/ラミアのけいやくしょ/1/1/1/0/2/0/0/SumNaga3/16000/summon:numA//\n1820/リザードマンのけいやくしょ/1/1/1/0/2/0/0/SumLizardman1/8000/summon:numA//\n1821/ドラゴンナイトのけいやくしょ/1/1/1/0/2/0/0/SumLizardman2/16000/summon:numA//\n1830/ゴブリンのけいやくしょ/1/1/1/0/2/0/0/SumGoblin1/7500/summon:numA//\n1831/オークのけいやくしょ/1/1/1/0/2/0/0/SumGoblin2/9500/summon:numA//\n1832/ダークナイトのけいやくしょ/1/1/1/0/2/0/0/SumGoblin3/12000/summon:numA//\n1833/ドワーフのけいやくしょ/1/1/1/0/2/0/0/SumGoblin4/15000/summon:numA//\n1840/アイスノードのけいやくしょ/1/1/1/0/2/0/0/SumNode1/10000/summon:numD//\n1841/サンダーノードのけいやくしょ/1/1/1/0/2/0/0/SumNode2/10000/summon:numD//\n1842/ディフェンスノードのけいやくしょ/1/1/1/0/2/0/0/SumNode3/10000/summon:numD//\n1850/ヒルコのけいやくしょ/1/1/1/0/2/0/0/SumLeech1/25000//hpr:20_mpr:40_regu:40/\n1860/キュベレーのけいやくしょ/1/1/1/0/2/0/0/SumWasp1/25000//hpr:20_regl:40_regp:40/\n1890/サーバントベル/0/4/5/0/0/0/0/Rising/5000/staff:numB//\n1900/スピア/0/2/14/0/4/0/0/Solid/2000/sword:numA:sho:pir//\n1920/フォーク/0/12/17/0/4/0/0/Massive/15000//num:11_dmg:20_dra:20/\n1921/トライデント/0/2/14/0/4/0/0/Solid/7000//atc:80_frz:1_hrg:10/\n1922/デスサイズ/1/24/32/0/8/0/0/Giga/7000//ctg:2_ctg:32_dth:1/\n1923/リーパー/1/19/27/0/8/0/0/Shuttle/5000/dagger:numA:timB:pir:dth//\n1930/ストーン/1/15/20/0/16/0/0/RockBom/3000/axe:numB:ran:bou//\n1931/シュリケン/0/10/12/0/0/0/0/Rapid/4000//crt:10_ran:1_frz:1_agi:100_mdr:10/\n1932/アイスロック/1/15/20/0/16/0/0/IceBom/5000/axe:numB:ran:bou//\n1933/スパイダーポッド/0/1/4/0/0/0/0/WebShot/4000//hpr:20_num:2_ran:2/";

      private var DATA_ENELIST:String = "1/ラット/0/4/0/1/4/0/0/0/5/20/-50/0/0/0/0/1/1/1/1/6/0/\n10/スネーク/0/18/0/2/5/0/0/0/8/20/0/-50/0/0/0/1/1/1/1/24/0/\n20/バット/0/8/0/2/5/0/0/0/25/20/0/0/0/0/0/1/1/1/2/12/0/\n30/ワーム/0/24/0/1/4/0/0/0/1/20/0/0/0/0/0/1/1/1/2/16/0/\n40/スライム/0/40/0/2/5/0/0/0/2/20/0/0/-50/0/0/1/1/1/10/20/0/\n50/スケルトン/0/23/0/5/8/0/0/0/3/20/40/0/0/0/0/1/1/1/3/24/0/\n90/インプ/3/22/30/2/5/0/0/0/3/20/40/0/0/0/40/1/1/1/11/25/0/\n60/ゾンビ/0/51/0/8/11/0/0/0/5/20/-50/0/0/0/0/1/1/1/4/32/0/\n80/グール/1/250/0/10/13/0/0/0/5/20/0/0/0/0/0/2/2/1/125/500/0/\n40/スライム/0/40/0/2/5/0/0/0/2/20/0/0/-50/0/0/1/1/1/10/20/0/\n50/スケルトン/0/23/0/5/8/3/0/0/3/20/40/0/0/0/0/1/1/1/3/24/0/\n90/インプ/3/22/30/2/5/0/0/0/3/20/40/0/0/0/40/1/1/1/11/25/0/\n60/ゾンビ/0/51/0/8/11/3/0/0/5/20/-50/0/0/0/0/1/1/1/4/32/0/\n80/グール/1/250/0/10/13/9/0/0/5/20/0/0/0/0/0/2/2/1/125/500/0/\n82/グール/1/250/0/10/13/9/0/0/5/20/0/0/0/0/0/2/2/1/125/500/0/\n94/ジョーカー/3/8000/999/2/5/40/0/0/20/20/20/20/100/100/50/1/1/1/5000/5000/0/\n7/キングラット/0/1000/0/28/33/7/0/0/64/20/0/0/40/40/0/2/2/1/150/400/0/\n51/スカルナイト/1/23/0/5/8/3/0/0/5/20/40/0/0/0/0/1/1/1/5/42/0/\n52/スカルアーチャー/2/23/0/5/8/3/0/0/5/20/40/0/0/0/0/1/1/1/5/42/0/\n41/ポイズンスライム/0/80/0/9/12/0/0/0/6/20/0/0/-50/250/0/1/1/1/20/50/0/\n100/ガーゴイル/0/95/50/1/4/27/0/0/0/20/20/0/0/0/0/2/2/1/36/200/1/\n11/サンドスネーク/0/55/0/15/18/0/0/0/15/20/0/-50/0/0/0/1/1/1/7/50/0/\n110/ゴースト/0/16/0/16/19/0/0/0/11/20/0/0/0/0/0/1/1/1/12/80/0/\n70/スパイダー/0/54/20/5/9/0/0/0/10/20/0/0/0/0/0/1/1/1/6/64/0/\n120/オルバンスおう/1/640/500/7/10/0/0/0/20/20/90/0/0/0/0/1/1/1/500/2000/0/\n122/ヘクトール/1/12000/250/126/129/38/0/0/150/20/90/20/20/20/100/1/1/1/2500/7500/0/\n261/ゴールデンローチ/0/120/0/1/50/9999/0/0/99/20/100/100/100/100/100/1/1/1/9999/255/0/\n130/ゴートマン/1/80/0/15/23/16/0/0/12/20/0/0/0/0/0/1/1/1/7/115/0/\n131/ゴートアーチャー/2/80/0/12/27/16/0/0/12/20/0/0/0/0/0/1/1/1/7/115/0/\n21/ヴァンパイアバット/0/64/0/16/21/4/0/0/40/20/0/0/0/0/0/1/1/1/9/80/0/\n140/ゴーレム/0/500/50/13/16/25/0/0/1/20/0/0/0/0/0/2/2/1/40/650/0/\n170/ミミック/0/160/0/25/28/50/0/0/25/20/0/0/0/0/0/1/1/1/66/500/0/\n150/ソーサラー/3/90/50/2/5/5/0/0/0/20/0/40/0/0/0/1/1/1/30/240/0/\n151/ヒーラー/4/200/180/2/5/5/0/0/0/20/0/40/0/0/0/1/1/1/100/700/0/\n160/モルケドだいじん/5/480/100/3/5/20/0/0/4/20/40/40/90/40/40/1/1/1/1499/3000/0/\n134/バフォメット/4/24000/999/109/125/65/0/0/120/20/0/99/0/0/50/1/1/1/5000/10000/0/\n830/キングローチ/0/2300/0/50/53/45/0/0/101/20/0/0/0/0/0/2/2/1/500/3255/0/\n121/オルバンスおう/1/2400/500/56/67/40/0/0/40/20/90/20/20/20/100/1/1/1/500/2000/0/\n480/モルドモンスター/0/5200/450/16/19/24/0/0/10/20/75/0/0/250/0/4/4/1/966/4000/1/\n500/モルド/0/300/0/16/19/24/0/0/10/20/75/0/0/250/0/1/1/1/15/77/1/\n661/ベビースパイダー/0/88/0/16/19/28/0/0/60/20/0/0/0/0/100/1/1/1/1/10/0/\n2/ブラウンラット/0/142/0/32/40/12/0/0/25/20/0/0/0/0/0/1/1/1/10/108/0/\n61/ロッティングコープス/0/240/0/35/40/10/0/0/5/20/-50/0/0/0/0/1/1/1/13/105/0/\n190/レッドクリーパー/0/100/30/17/20/0/0/0/7/20/80/-100/0/0/0/1/1/1/30/180/0/\n191/ブルークリーパー/0/160/30/14/17/0/0/0/7/20/-100/80/0/0/0/1/1/1/10/220/0/\n192/グリーンクリーパー/0/140/30/13/16/0/0/0/7/20/0/0/-100/80/0/1/1/1/20/200/0/\n220/マンイーター/0/870/20/24/34/12/0/0/13/20/-50/0/0/0/50/2/2/1/105/950/0/\n180/リーチ/0/60/10/27/30/0/0/0/5/20/0/0/0/0/0/1/1/1/8/45/0/\n550/ジャイアントリーチ/0/1280/100/25/28/11/0/0/0/20/0/0/0/0/0/1/1/1/300/1490/0/\n42/ブラッドスライム/0/160/0/32/38/0/0/0/17/20/0/0/-50/0/0/1/1/1/30/300/0/\n620/サハギン/0/140/30/9/34/24/0/0/16/20/0/100/-50/0/0/1/1/2/36/348/0/\n31/ポイズンワーム/0/234/0/22/29/0/0/0/3/20/0/0/0/100/0/1/1/1/10/66/0/\n200/ラージスライム/0/600/20/30/35/0/0/0/14/20/0/0/-50/0/0/2/2/1/240/600/0/\n210/ぶんれつスライム/0/120/0/18/21/0/0/0/14/20/0/0/-50/0/0/1/1/1/0/0/0/\n201/ラージポイズンスライム/0/900/20/30/35/0/0/0/14/20/0/0/0/250/0/2/2/1/240/900/0/\n211/ぶんれつポイズンスライム/0/120/0/20/23/0/0/0/14/20/0/0/-50/250/0/1/1/1/0/0/0/\n230/ヒュージスライム/0/5600/300/67/72/0/0/0/2/20/0/0/-50/0/0/4/4/1/1440/3600/0/\n185/ヒルコ/0/20000/999/101/104/90/0/0/120/20/0/120/0/0/100/1/1/1/1000/15000/0/\n32/ロイヤルワーム/0/250/30/23/31/24/0/0/5/20/0/0/0/0/0/1/1/1/25/410/0/\n310/ビッグワーム/0/1600/30/35/43/28/0/0/7/20/0/0/0/0/0/2/2/1/160/1600/0/\n260/ローチ/0/110/0/14/17/15/0/0/31/20/0/0/0/0/0/1/1/1/10/255/0/\n71/レッドスパイダー/0/200/30/19/23/8/0/0/20/20/0/0/0/0/0/1/1/1/14/228/0/\n530/キラーバイン/0/340/0/14/17/45/0/0/0/20/-50/0/0/50/50/1/3/1/25/192/0/\n240/キラーワスプ/0/90/0/21/24/0/0/0/60/20/0/0/0/90/0/1/1/1/5/90/0/\n250/ハイブ/0/800/0/0/0/30/0/0/0/20/-50/0/0/0/0/3/3/1/150/2700/1/\n280/センチピード/0/600/0/23/26/20/0/0/9/20/0/0/0/20/0/1/1/1/32/940/0/\n270/マッドフラワー/0/650/50/13/16/20/0/0/0/20/-50/0/0/100/0/2/2/1/125/877/1/\n320/イシュトール/0/8000/200/41/49/32/0/0/13/20/0/0/0/0/100/1/2/1/3859/9999/0/\n570/グランドセンチピード/0/24000/0/200/225/95/0/0/59/20/0/0/0/0/100/2/2/1/1032/8240/0/\n244/キュベレー/0/8700/999/91/94/99/0/0/340/20/0/0/200/90/20/1/1/1/4000/20000/0/\n256/メガロハイブ/0/4000/0/0/0/30/0/0/0/20/0/0/0/0/100/5/5/1/0/0/1/\n246/クイーンワスプ/0/7200/400/93/102/20/0/0/120/20/0/0/0/100/0/4/3/1/500/5000/0/\n340/デーモン/0/320/25/15/23/16/0/0/20/20/40/0/0/0/0/2/1/1/42/450/0/\n350/マッドビースト/0/1250/30/33/36/24/0/0/24/20/0/0/0/0/0/2/2/1/56/1050/0/\n141/ストーンゴーレム/0/750/50/41/49/75/0/0/10/20/0/0/0/0/0/2/2/1/100/1400/0/\n81/オーガ/1/780/50/46/59/12/0/0/7/20/0/0/0/0/0/2/2/1/72/780/0/\n540/ボマー/0/244/0/26/29/16/0/0/0/20/-50/0/0/0/0/1/1/1/25/489/0/\n380/グレーターデーモン/0/2700/250/45/48/45/0/0/20/20/75/50/0/25/0/3/3/1/333/2100/0/\n360/ファミリア/0/150/50/32/36/30/0/0/17/20/0/0/0/0/0/1/1/1/28/292/0/\n361/レッドファミリア/0/150/50/17/20/30/0/0/17/20/100/-100/0/0/0/1/1/1/28/292/0/\n362/ブルーファミリア/0/150/50/17/20/30/0/0/17/20/-100/100/0/0/0/1/1/1/28/292/0/\n363/イエローファミリア/0/150/50/17/20/30/0/0/17/20/0/0/100/-100/0/1/1/1/28/292/0/\n221/グラットン/0/2942/40/52/62/20/0/0/27/20/-50/10/10/10/100/2/2/1/160/2000/0/\n430/ドラゴン/0/8096/850/65/68/64/0/0/45/20/100/55/55/55/25/4/4/1/1248/7200/0/\n370/ウォッチロック/0/300/40/25/31/50/0/0/20/20/20/20/20/20/0/1/1/1/38/333/1/\n850/メガロック/0/3000/200/50/56/50/0/0/40/20/20/20/20/20/0/2/2/1/280/2105/1/\n202/ラージブラッドスライム/0/1600/20/56/61/0/0/0/27/20/0/0/0/0/0/2/2/1/360/1800/0/\n212/ぶんれつブラッドスライム/0/160/0/32/38/0/0/0/27/20/0/0/-50/0/0/1/1/1/0/0/0/\n510/バルログ/0/9999/480/45/48/45/0/0/20/20/90/75/15/75/50/8/8/1/5000/16000/0/\n391/パズズ/0/17000/999/133/136/65/0/0/120/20/200/0/40/80/100/2/2/1/3000/12000/0/\n630/サラマンダー/0/16500/2000/40/43/80/0/0/60/20/200/-50/20/50/100/4/4/1/6500/11200/0/\n420/ロウムアーマー/0/650/0/46/49/92/0/0/10/20/0/0/0/0/0/2/2/1/45/1100/0/\n390/エンジェル/0/240/40/15/24/25/0/0/104/20/0/0/100/0/0/2/2/1/52/777/0/\n400/サキュバス/0/512/20/10/13/12/0/0/24/20/0/0/0/0/0/2/1/1/200/1667/0/\n600/サーペント/0/7200/300/25/28/36/0/0/0/20/20/100/-50/0/0/2/4/1/205/1240/1/\n171/スーパーミミック/0/500/0/61/64/75/0/0/75/20/90/90/90/90/0/1/1/1/232/2400/0/\n152/ウィザード/0/250/240/3/6/10/0/0/7/20/60/20/20/0/0/1/1/1/90/1600/0/\n142/ファイアゴーレム/0/1250/80/19/22/40/0/0/15/20/200/-100/0/0/0/2/2/1/160/2000/0/\n410/ヴァンパイア/0/700/90/27/33/20/0/0/36/20/0/0/0/0/0/1/1/1/55/999/0/\n421/ゲートキーパー/0/2000/40/46/57/108/0/0/30/20/0/0/0/0/0/2/2/1/299/4000/0/\n440/アシュエル/0/9999/999/27/36/64/0/0/130/20/50/50/100/25/100/1/1/1/9999/24000/0/\n393/カマエル/0/19000/999/122/131/100/0/0/360/20/40/40/40/40/40/2/2/1/4000/15000/0/";

      private var DATA_CHALIST:String = "0/ニュートラル/1//46//\n1/ファイター/1//46//\n2/ハンター/2//46//\n3/メイジ/3//46//\n4/プリースト/4//46//\n5/サモナー/5//46//\n6/プレイヤー6/2//46//\n7/プレイヤー7/2//46//\n8/プレイヤー8/2//46//\n9/ロード/2//46//\n10/ガード/2//46//\n11/プレイヤー11/2/nnnn/46//\n12/プレイヤー12/2/mmmm/46//\n100/はか/1//46//\n101/トム/10/0211/7/0/\n102/マイセン/0/8403/1//\n103/タラバールおう/9/9l11/10/0/\n104/ハンス/10/s211/29/0/\n105/ラブレひめ/9/i813/11/0/\n106/ソアラおうひ/9/h612/10/0/\n107/ロバート/10/3c02/35/0/\n108/キート/10/0211/27/0/\n109/エドガー/0/bk22/1//\n110/トーキン/0/000y6/1//\n112/ロジャー/0/el0j/1//\n115/カノッサ/0/i30N/1//\n118/エルダナン/10/9011/45/0/\n119/ヒーラー/4//45/0/\n120/ニック/0/r005/9//\n121/たてふだ/1//35/0/\n122/スティーブ/10/0211/14/0/\n123/アネッサ/0/ie0L/1//\n130/ほんだな/1//35/0/\n131/アンディ/1/ug09/36/6500/\n132/ジュエリー/0/pc0t/1//\n133/ビネガー/10/0211/31/0/\n134/バイエルン/2/gklj0/28/4500/\n137/ケイン/1/0035/5/200/\n138/ロイ/1/4j06/11/1500/\n140/アルス/1/190c/1/300/\n141/リサ/2/lb0r/9/400/\n142/マケロン/3/y644/12/500/\n143/フォルクス/4/00bd/13/500/\n146/マット/1/00L1/4//\n157/マイケル/0/0602/4//\n158/ラスベリー/1/00ce/22/5000/\n168/セグメト/1/mz0h/27/4000/\n169/ボンチッチ/1//46//\n170/ポロン/1//46//\n171/カルデシアのぞう/1//46//\n172/ユルグシアのぞう/1//46//\n175/グレオニス/0/u30E/1//\n177/ゼクス/1/00te/25/3500/\n178/ガイナード/1/4kNm/25/3500/\n196/セルジオ/1/6d0M/55/10000/\n167/ニラワンダ/2/ag0d/15/0/\n134/バイエルン/2/a2on/28/4500/\n166/ジョー/2/is8j/29/3500/\n179/ツバキ/2/l60I/29/3800/\n200/マードック/2/wk0i/29/3000/\n162/サイゾウ/2/b0iQ/37/4200/\n163/モルガン/2/mKcc/47/11000/\n187/あんな/2/F200/70/999999/\n127/アッシュ/2/g80s/92/-1/\n113/リンダ/0/l00I/1/-1/\n139/フェルマー/3/u0cc/11/1500/\n193/ベンジャミン/3/Ms0q/41/7200/\n136/ドルマ/3/B50a/35/-1/\n111/マゼンタ/3/m40o/1/-1/\n185/ザイーガ/3/EBmc/40/-1/\n144/コースタン/4/002J/7/750/ようへいを ふくぎょうとするプリースト。 おさけが のめない たいしつのため、 ふだんは さかばで ミルクをのみながら しごとを まっている。\n159/スケルトン/1//7/-1/\n161/サンドラ/4/m7li/21/2100/\n201/ゴルゴス/4/cr0z/31/3000/\n194/バジル/4/myNQ/45/7200/\n176/メリッサ/4/oc0J/1/-1/\n114/ノーマン/4/hp0e/1/-1/\n197/エメルスへい/4/00eC/30/-1/\n165/ペリエ/5/Ad6p/14//\n145/ジェイル/5/5501/17//\n164/エンリケ/5/F0PI/41//\n116/ダンテ/5/00cu/1/-1/\n195/ウラニウス/5/b00M/70/-1/\n117/モルケドだいじん/5/t502/40/-1/";

      private var DATA_DROPLIST:String = "1,1000,1000\n1,1023,100\n10,1300,1000\n10,1301,1000\n10,1220,100\n20,1200,1000\n20,1400,1000\n30,900,1000\n30,1122,100\n40,1500,1000\n40,1501,1000\n40,1521,100\n50,1200,1000\n50,1201,1000\n50,1001,1000\n50,1024,100\n90,1400,1000\n90,1401,1000\n90,1500,1000\n90,1501,1000\n60,1100,1000\n60,1101,1000\n60,1120,100\n80,1020,10000\n51,1000,1000\n51,1002,1000\n51,900,1000\n51,901,1000\n51,1023,100\n52,1300,1000\n52,1302,1000\n52,1321,100\n41,1501,1000\n41,1503,1000\n100,1400,1000\n100,902,1000\n100,1420,100\n11,1301,1000\n110,1502,1000\n110,1122,100\n70,1201,1000\n70,1202,1000\n70,1221,100\n70,1933,100\n120,1505,10000\n1100,12,10000\n130,1102,1000\n130,1101,1000\n130,1100,1000\n130,1601,1000\n130,1900,1000\n130,1120,50\n131,1303,1000\n131,1302,1000\n131,1301,1000\n131,1611,1000\n131,1322,50\n21,1003,1000\n21,1402,1000\n140,1503,1000\n140,1502,1000\n140,902,1000\n140,1630,1000\n140,1522,50\n260,1105,1000\n260,1204,1000\n260,902,1000\n830,1105,1000\n830,1510,1000\n830,803,50\n830,1121,50\n261,800,1000\n261,820,1000\n261,1204,1000\n261,1205,1000\n261,1790,1000\n261,12,1000\n170,800,1000\n170,820,1000\n150,1401,1000\n150,1407,1000\n150,1403,1000\n150,1421,50\n151,1500,1000\n151,1501,1000\n151,1502,1000\n151,1506,1000\n134,1508,1000\n134,1603,50\n134,1124,50\n160,10,10000\n160,1680,10000\n2,1003,1000\n2,1004,1000\n2,1001,1000\n2,1024,50\n61,1503,1000\n61,1102,1000\n31,1202,1000\n31,1303,1000\n31,920,50\n42,1503,1000\n42,1502,1000\n42,1402,1000\n191,1401,1000\n191,1304,1000\n191,1025,50\n190,1400,1000\n190,1408,1000\n192,1407,1000\n192,1304,1000\n220,1305,1000\n220,1504,1000\n200,1404,1000\n200,1500,1000\n200,1501,1000\n200,1640,1000\n200,1521,50\n620,1900,1000\n620,1004,1000\n620,1105,1000\n620,1760,1000\n620,1921,50\n180,1201,1000\n180,1203,1000\n550,1203,1000\n550,1205,1000\n550,800,1000\n550,820,1000\n201,1404,1000\n201,1641,1000\n500,1002,1000\n661,1933,50\n185,1510,1000\n185,1850,50\n185,1225,50\n230,1512,10000";

      private var DATA_SKILLDATA:String = "1/エアスラッシュ/しんくうはを はなつ\n2/ハイスラッシュ/きょうれつな しんくうはを はなつ\n3/ソードラッシュ/こうそくで てきをきりきざみながら かけぬける\n4/チリングブレード/ぶきに れいきをまとわせて きる\n5/ウィンドカッター/おおきな かぜのやいばを はなつ\n6/ギガブレード/ぶきを きょだいかして なぎはらう\n7/カマイタチ/まわりを むさべつに きりきざむ\n8/ブレードゲイル/ぜんぽうを むさべつに きりきざむ\n9/スマッシュバブル/てきを はじきとばす\n10/トルネード/たつまきを うみだす\n11/フレイムブレード/ぶきを はっかさせて きる\n12/ライフガード/なかまが しにかけたとき みがわりになる\n13/ミンチチョッパー/ひきにくのように きりきざむ\n14/グランドクラッシュ/きょうりょくな いちげきで じめんごと はかいする\n15/ジャンプアタック/とびはねて こうげきする\n16/スローイング/ぶきを ほうりなげる\n17/スピニングチャージ/ぶきを ふりまわしながら つきすすむ\n18/マッシブホバー/ぶきを ちゅうにとばす\n19/ホイールウェポン/ぶきを くうちゅうで せんかいさせる\n20/アースインパクト/しょうげきはを はしらせる\n21/ラピッドシュート/ぶきを すばやく なげつける\n22/ダンシングブレード/ぶきを じぶんのまわりに とばす\n23/ベノム/ぶきに どくを ぬりつける\n24/ピアッシングプレス/すばやい しとつで せめたてる\n25/ブービートラップ/あしもとに わなを せっちする\n26/ヘイスト/いどうスピードが はやくなる\n27/ミキリ/てきのこうげきを そうさいする\n28/アサシネイション/はいごから あんさつを こころみる\n29/デコイ/おとりのにんぎょうを せっちする\n30/フロックアロー/たいりょうの やを うつ\n31/スタンアロー/せんこうだんを はなつ\n32/レインアロー/やのあめを ふりそそがせる\n33/スプレッドアロー/ぜんほういに やを うつ\n34/ポイズンアロー/どくガスをばらまく やを うつ\n35/マシンガンアロー/こうそくで やを らんしゃする\n36/フレイムアロー/もえさかる やを うつ\n37/スナイプショット/いちげきひっさつの やを はなつ\n38/サテライト/くうちゅうに ゆみを うかべる\n39/ライトアロー/ひかりのやを うつ\n40/タイタニックアロー/きょだいな やを はっしゃする\n41/アブソーブアロー/エネルギーをきゅうしゅうする やを はなつ\n42/ファイアボール/ひのたまを とばす\n43/アイスブラスト/れいきのとっぷうを はなつ\n44/ストーンウォール/いしのかべを つくりだす\n45/レイ/ほとばしる せんこうを はなつ\n46/スプリット/ぶんしんを つくりだす\n47/メテオ/しゃくねつのいんせきを おとす\n48/マナオーブ/きょうりょくな エネルギーたいを うみだす\n49/スパークボール/でんきをおびた きゅうたいを とばす\n50/フレイムスローワー/かえんを ほうしゃする\n51/ブリザード/ふぶきを よびおこす\n52/ライトニング/いかづちを おとす\n53/マジックミサイル/ちいさな エネルギーたいを はなつ\n54/アイスブランド/ぶきに れいきをやどす\n55/ファイアブランド/ぶきに ひをともす\n56/サンダーブランド/ぶきに でんきをながす\n57/アイスビーム/いてつくこうせんを そうしゃする\n58/バブルバリア/あわのまくで ダメージを うちけす\n59/アースクエイク/じしんを ひきおこす\n60/フローズンオーブ/ちょうていおんの きゅうたいを なげつける\n61/ヒーリング/みかたを かいふくさせる\n62/プロテクト/ぶつりダメージを けいげんする\n63/ブースト/なかまのこうげきの いりょくを たかめる\n64/パニッシュ/せいなる てっついを くらわせる\n65/コンフュージョン/てきを こんらんさせる\n66/ヘビースタンプ/しゅういに しょうげきはを くりだす\n67/サンクチュアリ/せいいきを つくりだす\n68/マジックシールド/ぞくせいダメージを けいげんする\n69/リフレクト/うけたダメージを はんしゃする\n70/リフレッシュ/じょうたいいじょうの めんえきを つける\n71/サンダーストライク/でんきをおびた はかいの いちげき\n72/マナドレイン/MPをすいとって なかまに あたえる\n73/バプテスマ/せいなる ちからを うめこむ\n74/マナフィールド/まほうの ゆかを つくりだす\n75/スカルナイト しょうかん/スカルナイト しょうかん\n76/ゴートマン しょうかん/ゴートマン しょうかん\n77/バフォメット しょうかん/バフォメット しょうかん\n78/スカルアーチャー しょうかん/スカルアーチャー しょうかん\n79/ボーンナイト しょうかん/ボーンナイト しょうかん\n80/ヘクトール しょうかん/ヘクトール しょうかん\n81/ボーンスナイパー しょうかん/ボーンスナイパー しょうかん\n82/ゴートアーチャー しょうかん/ゴートアーチャー しょうかん\n83/ナイトクラン しょうかん/ナイトクラン しょうかん\n84/デスクラン しょうかん/デスクラン しょうかん\n85/ヒルコ しょうかん/ヒルコ しょうかん\n86/キュベレー しょうかん/キュベレー しょうかん\n87/ガーゴイル しょうかん/ガーゴイル しょうかん\n88/ゴーレム しょうかん/ゴーレム しょうかん\n89/ストーンゴーレム しょうかん/ストーンゴーレム しょうかん\n90/ファイアゴーレム しょうかん/ファイアゴーレム しょうかん\n91/アイスゴーレム しょうかん/アイスゴーレム しょうかん\n92/ゴールデンゴーレム しょうかん/ゴールデンゴーレム しょうかん\n93/ブラッドゴーレム しょうかん/ブラッドゴーレム しょうかん\n94/Lスライム しょうかん/Lスライム しょうかん\n95/Lポイズンスライム しょうかん/Lポイズンスライム しょうかん\n96/Lブラッドスライム しょうかん/Lブラッドスライム しょうかん\n97/Lメタルスライム しょうかん/Lメタルスライム しょうかん\n98/マッドフラワー しょうかん/マッドフラワー しょうかん\n99/ケイブスター しょうかん/ケイブスター しょうかん\n100/デーモン しょうかん/デーモン しょうかん\n101/アークデーモン しょうかん/アークデーモン しょうかん\n102/グレーターデーモン しょうかん/グレーターデーモン しょうかん\n103/マッドビースト しょうかん/マッドビースト しょうかん\n104/グール しょうかん/グール しょうかん\n105/オーガ しょうかん/オーガ しょうかん\n106/トロール しょうかん/トロール しょうかん\n107/サイクロプス しょうかん/サイクロプス しょうかん\n108/ファミリア しょうかん/ファミリア しょうかん\n109/エンジェル しょうかん/エンジェル しょうかん\n110/レイヴン しょうかん/レイヴン しょうかん\n111/カマエル しょうかん/カマエル しょうかん\n112/サキュバス しょうかん/サキュバス しょうかん\n113/リリス しょうかん/リリス しょうかん\n114/ヴァンパイア しょうかん/ヴァンパイア しょうかん\n115/ロウムアーマー しょうかん/ロウムアーマー しょうかん\n116/デスアーマー しょうかん/デスアーマー しょうかん\n117/デビルアーマー しょうかん/デビルアーマー しょうかん\n118/ドラゴン しょうかん/ドラゴン しょうかん\n119/サハギン しょうかん/サハギン しょうかん\n120/マーマン しょうかん/マーマン しょうかん\n121/ボマー しょうかん/ボマー しょうかん\n122/ステインポット しょうかん/ステインポット しょうかん\n123/サーペント しょうかん/サーペント しょうかん\n124/エビルウィード しょうかん/エビルウィード しょうかん\n125/シードラゴン しょうかん/シードラゴン しょうかん\n126/ゴールデンローチ しょうかん/ゴールデンローチ しょうかん\n127/パズズ しょうかん/パズズ しょうかん\n128/インプ しょうかん/インプ しょうかん\n129/コロボックル しょうかん/コロボックル しょうかん\n130/レプラコーン しょうかん/レプラコーン しょうかん\n131/ノーム しょうかん/ノーム しょうかん\n132/ジョーカー しょうかん/ジョーカー しょうかん\n133/ドワーフ しょうかん/ドワーフ しょうかん\n134/ナーガ しょうかん/ナーガ しょうかん\n135/ナーガラージャ しょうかん/ナーガラージャ しょうかん\n136/ラミア しょうかん/ラミア しょうかん\n137/リザードマン しょうかん/リザードマン しょうかん\n138/ドラゴンナイト しょうかん/ドラゴンナイト しょうかん\n139/ゴブリン しょうかん/ゴブリン しょうかん\n140/オーク しょうかん/オーク しょうかん\n141/ダークナイト しょうかん/ダークナイト しょうかん\n142/アイスノード しょうかん/アイスノード しょうかん\n143/サンダーノード しょうかん/サンダーノード しょうかん\n144/ディフェンスノード しょうかん/ディフェンスノード しょうかん\n146/ロックボム/いわを なげつける\n147/アイスボム/ひょうかいを なげつける\n148/ヒートブレス/しゃくねつのいきを ふきかける\n154/ロトンブレス/もうどくのガスを ふきかける\n155/シャトルブレード/ぶきをとばして ふゆうさせる\n167/ソリッドシュート/ぶきをなげて てきを つらぬく\n168/ラブレショット/たいまの はどうを はなつ\n171/ストロングホールド/しゅういに とりでを きずく\n172/ギガプレス/しょうげきはで てきを おしつぶす\n173/ウェブショット/くものいとを とばす\n174/ヴォルケイノ/かこうを ひらき ようがんを ふきあがらせる\n175/ラウジングサウンド/しもべの レベルを ひきあげる";

      private var DATA_CHALLENGEDATA:String = "";
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * AccessBypass: AccessBypassのコンストラクタ。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function AccessBypass(Main:*)
      {
         super();
         this.Main = Main;
         this.setDataDict("itemlist",getFilledData(DATA_ITEMLIST,2000,"{index}/アイテム{index}/0/4/8/0/0/0/0/Slash/100/ring:shield:sword:axe:dagger:bow:staff:mace:summon//せつめい"));
         this.setDataDict("enelist",getFilledData(DATA_ENELIST,1200,"{index}/エネミー{index}/0/4/0/1/4/0/1/1/105/5/-50/0/0/0/0/1/1/1/1/6/0/せつめい"));
         this.setChaList();
         this.setDataDict("droplist",DATA_DROPLIST);
         this.setFloorName();
         this.setTalkData();
         this.setDataDict("skilldata",getFilledData(DATA_SKILLDATA,200,"{index}/スキル{index}/せつめい"));
         this.setDataDict("ezukan",getFilledData("",1200,"{index},1",",","/"));
         this.setDataDict("izukan",getFilledData("",2000,"{index}","","/"));
         this.setDataDict("challengedata",getFilledData(DATA_CHALLENGEDATA,1200,"{index}/158 159"))
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * setDataDict: data_dictにキーとその値を設定します。
       * 
       * key: キー
       * value: 値
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function setDataDict(key:String, value:*) : void
      {
         AccessBypass.data_dict[key] = value;
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getDataDict: data_dictの特定のキーの値を返します。
       * 
       * key: キー
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getDataDict(key:String) : *
      {
         return AccessBypass.data_dict[key];
      }

      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getLoaderData: 本来イニシエダンジョンのサーバーに送る予定だったデータを受け取り、サーバーから返される予定だったオブジェクトを返します。
       * 
       * url_data: 型はURLVariables。本来サーバーに送る予定だったデータ。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getLoaderData(_url_data:Object) : Object
      {
         var data:Object = new Object();
         url_data = _url_data;
         data.mode = url_data.mode;
         data.error = null;
         if(data.mode == "first")
         {
            data.account = url_data.account;
            data.time = 0;
            data.ano = null;
            data.playcount = 10;
            data.counttime = 0;
            data.regularflag = "0";
            data.seed = null;
            data.registflag = 0;
            data.loginkey = null;
            data.upresettime = 0;
            data.charaData = null;
            data.partyData = "0,1,0,0,1234,0,0,,,<>";
            data.questData = null;
            data.itemData = "";
            data.itemlist = this.getDataDict("itemlist");
            data.chalist = this.getDataDict("chalist");
            data.enelist = this.getDataDict("enelist");
            data.droplist = this.getDataDict("droplist");
            data.floorname = this.getDataDict("floorname");
            data.talkdata = this.getDataDict("talkdata");
            data.skilldata = this.getDataDict("skilldata");
            data.challengedata = this.getDataDict("challengedata");
            data.ezukan = this.getDataDict("ezukan");
            data.izukan = this.getDataDict("izukan");
         }
         else if(data.mode == "charamake")
         {
            data.seed = url_data.seed;
            data.id = url_data.id;
            data.pass = "";
            data.playcount = 10;
            data.counttime = 0;
            data.loginkey = "";
            data.newchara = this.getNewChara();
            data.itemData = this.getDataDict("itemData");
            data.accesskey = url_data.accesskey;
            data.loginkey = url_data.loginkey;
         }
         else if(data.mode == "gamestart")
         {
            data.accesskey = url_data.accesskey;
            data.account = url_data.account;
            data.partyData = this.getPartyData();
            data.loginkey = url_data.loginkey;
            data.seed = url_data.seed;
            data.time = 0;
            data.playcount = 10;
            data.counttime = 0;
            data.playkey = "";
            data.zombieid = "";
            data.zindex = 0;
            data.practice = 0;
            this.setCharaData();
            data.charaData = this.getDataDict("charaData");
            data.questData = this.getDataDict("questData");
            data.itemData = this.getItemData();
         }
         else if(data.mode == "mapload")
         {
            data.mapdata = this.getMapData();
            data.rescue = 0;
            data.encount = "";
            data.emerge = this.getEmerge();
         }
         return data;
      }

      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getFilledData: 元のデータを配列に変換し、空いているインデックスにデータを埋め、再度文字列に変換したデータを返します。
       * 
       * size: 新しいデータのサイズ。
       * fillData: 空のインデックスに埋める文字列。（{index}という文字列はインデックスに置き換えられます。）
       * divisor1: データを区切る文字。 
       * divisor2: divisor1より大きなまとまりのデータを区切る文字。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getFilledData(originalData:String, size:int, fillData:String, divisor1:String = "/", divisor2:String = "\n") : String
      {
         var newData:Array = new Array(size);
         var i:int = 0;
         while(i < size)
         {
            newData[i] = fillData.replace(/{index}/g,String(i));
            i++;
         }
         i = 0;
         var splitData:Array = originalData.split(divisor2);
         while(i < splitData.length)
         {
            var item:String = String(splitData[i]);
            var arr:Array = item.split(divisor1);
            var index:int = int(arr[0]);
            newData[index] = item;
            i++;
         }
         return newData.join(divisor2);
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * setChaList: chalistというデータベースを定義します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function setChaList() : void
      {
         setDataDict("chalist",getFilledData(DATA_CHALIST,1000,"{index}/キャラ{index}/1/a/30//"));
         var dataArr:Array = getDataDict("chalist").split("\n");
         // chalistの0~10番目のアバター部分(4番目のステータス)を空白以外にすると、そのインデックスに対応する職業のキャラのアバターがそのアバターになる、という不思議な仕様が存在するので、アバター部分を空白にしておく。
         var i:int = 0;
         while(i <= 10)
         {
            dataArr[i] = String(i) + "/キャラ"+ String(i) +"/1//30//";
            i++;
         }
         this.setDataDict("chalist",dataArr.join("\n"));
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * setFloorName: floornameというデータベースを定義します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function setFloorName() : void
      {
         var floorName:String = "";
         var floorNameArr:Array = [];
         var floorNameArr2:Array = [];
         var i:int = 0;
         var j:int = 1;
         while(i < 20)
         {
            floorNameArr[i] = [];
            i++;
         }
         i = 0;
         while(i < 20)
         {
            j = 0;
            while(j <= 120)
            {
               floorNameArr[i].push(String(i) + "," + String(j) + ",jail,ちかろう");
               j++;
            }
            floorNameArr2[i] = floorNameArr[i].join("\n");
            i++;
         }
         floorName = floorNameArr2.join("\n");
         this.setDataDict("floorname",floorName);
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * setTalkData: talkdataというデータベースを定義します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function setTalkData() : void
      {
         var talkData:String = "";
         var talkDataArr:Array = [];
         var talkDataArr2:Array = [];
         var i:int = 0;
         var j:int = 1;
         while(i < 300)
         {
            talkDataArr[i] = [];
            i++;
         }
         i = 0;
         while(i < 20)
         {
            j = 0;
            while(j <= 10)
            {
               talkDataArr[i].push(String(i) + "/" + String(j) + "/かいわ i,j");
               j++;
            }
            talkDataArr2[i] = talkDataArr[i].join("\n");
            i++;
         }
         talkData = talkDataArr2.join("\n");
         this.setDataDict("talkdata",talkData);
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * setCharaData: charadataというデータベースを定義します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function setCharaData() : void
      {
         var charaData:String = "";
         var charaDataArr:Array = [];
         var i:int = 0;
         while(i < 12)
         {
            charaDataArr[i] = "";
            i++;
         }
         charaDataArr[0] = this.getNewChara();
         charaData = charaDataArr.join("/");
         this.setDataDict("charaData",charaData);
      }
      
      public function getPartyData() : String
      {
         var p:PartyData = this.Main.playData.myData.party_data;
         var partyDataArr:Array = [p.AREA,p.FLOOR,p.XX,p.YY,p.SEED,p.TIME,p.RESCUE,p.DROP_INDEX,p.ZOMBIE_DROP,p.ZOMBIE_INDEX];
         partyDataArr = [p.AREA,p.FLOOR,p.XX,p.YY,Math.floor(Math.random()*2147483647),p.TIME,p.RESCUE,p.DROP_INDEX,p.ZOMBIE_DROP,p.ZOMBIE_INDEX];
         var partyData:String = partyDataArr.join(",");
         partyData += "<>";
         return partyData + "Chara1,,0";
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getNewChara: キャラクリで作成されたキャラを返します。（※まだ仮のコードです。）
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getNewChara() : String
      {
         var newchara:String = "";
         var status:Object = new Object();
         status.ID = "Chara1";
         status.slotNo = this.getDataDict("slot");
         status.NAME = this.getDataDict("name");
         status.NO =  this.getDataDict("job");
         status.AVATAR = "11111";
         status.LV = 1;
         status.EXP = 0;
         status.HP = 50;
         status.EQUIP_WEAPON = -1;
         status.EQUIP_SHIELD = -1;
         status.EQUIP_RING = -1;
         status.LOG_NAME = "";
         status.ZOMBIE_TIME = 0;
         status.UNDEAD = 0;
         status.play_count = 0;
         newchara = status.ID + "," + status.slotNo + "," + status.NAME + "," + status.NO + "," + status.AVATAR + "," + status.LV + "," + status.EXP + "," + status.HP + "," + status.EQUIP_WEAPON + "," + status.EQUIP_SHIELD + "," + status.EQUIP_RING + "," + status.LOG_NAME + "," + status.ZOMBIE_TIME + "," + status.UNDEAD + "," + status.play_count;
         return newchara;
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getItemData: 所持品、倉庫、バッグのデータを返します。（※まだ仮のコードです。）
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getItemData() : String
      {
         var itemData:String = "";
         var itemDataArr:Array = [];
         itemDataArr.push("1000,,,Chara1,0,0");
         itemDataArr.push("900,,,Chara1,0,1");
         itemDataArr.push("1,,,Chara1,0,2");
         itemDataArr.push("3,,,Chara1,0,3");
         return itemDataArr.join("/");
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getItemData: マップデータを返します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getMapData() : String
      {
         var mapData:String = "222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,31,0,0,0,0,0,0,0,0,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,0,0,0,0,0,0,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,222,222,222,222,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,0,0,0,0,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,0,0,0,0,130,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,0,0,0,0,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,130,0,0,0,0,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,0,0,0,0,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,0,0,0,0,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,222,222,222,222,222,222,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,0,0,0,0,0,0,0,0,0,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,0,0,0,0,0,0,0,0,0,0,0,41,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222/222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222,222";
         return String(this.Main.compressData(mapData));
      }
      
      /* ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       * getItemData: 敵の出現情報を返します。
       * ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
       */
      public function getEmerge() : String
      {
         var emergeArr:Array = [];
         emergeArr.push("0,1,0,0,0,10");
         emergeArr.push("1,10,0,0,0,20");
         emergeArr.push("2,20,0,0,0,30");
         emergeArr.push("3,30,0,0,0,40");
         return emergeArr.join("/");
      }
   }
}
